In [1]:
print("hello world")

hello world

In [2]:
print ("this is the first class coding python")

this is the first class coding python

In [3]:
a = 10 
b = 3 
print(a + b)  # 13 
print(a - b)  # 7 
print(a * b)  # 30 
print(a / b)  # 3.3333 
print(a % b)  # 1 
print(a ** b)  # 1000 
print(a // b)  # 3

13
7
30
3.3333333333333335
1
1000
3

In [10]:
  if True:
        print ("Hello World")

Hello World

In [13]:
""" 
This is a 
multi-line comment 
"""
if True:
        print ("Hello World")
# This is a single-line comment

Hello World

In [16]:
x = "hello world"
print (x)

hello world

In [22]:
name = "mary"
print (name)
y=6
y

mary

6

In [1]:
isActive = True

In [26]:
X=Y=Z=1
print(X)
print(Y)
print(Z)

1
1
1

In [28]:
x,y,z=1,2.39,'cat'
print(x)
print(y)
print(z)

1
2.39
cat

In [29]:
x=1
y=2.39
z='cat'

In [39]:
first = 10
second = 7
second >= first

False

In [42]:
5>3 or 9<10

True

In [43]:
5<3 or 9<10

True

In [50]:

'D' in 'data analysis'

False

In [49]:
'd' in 'cyber security'

False

In [51]:
'CYBER' in 'data'

False

In [2]:
#1,2,3,4,5,6,7,8,9,10
for x in range (1,11):
    print (x, end = ",")

1
2
3
4
5
6
7
8
9
10

In [6]:
#1,2,3,4,5,6,7,8,9,10
total = 0
for x in range (1,11):
    total+=x
    print(x, end = ",")

print('\n',total)

1,2,3,4,5,6,7,8,9,10,
 55

In [7]:
for x in range (1,36,4):
    print(x)

1
5
9
13
17
21
25
29
33

In [13]:
x=int(input("Enter Age: "))
y=int(input("Enter Age: "))
z=int(input("Enter Age: "))
xy=int(input("Enter Age: "))

total = x+y+z+xy
average = total/4

print(total, average)

Enter Age:  12
Enter Age:  20
Enter Age:  32
Enter Age:  45

109 27.25

In [19]:
total=0
for x in range(4):
    x= int(input("Enter Age"))
    total +=x
    print (x,end=",")

print('\n',total, total/4)

Enter Age 223

223,

Enter Age 23

23,

Enter Age 2

2,

Enter Age 1

1,
 249 62.25

In [25]:
#assignment for the class q1: write a loop that recieve 5 scores from the key board and displays the average.
total=0
for x in range (5):
    x= int(input("Enter Scores"))
    total +=x
    print (x,end=",")
average=total/5
print(average)

Enter Scores 50

50,

Enter Scores 40

40,

Enter Scores 30

30,

Enter Scores 20

20,

Enter Scores 45

45,37.0

In [34]:
#while loop
count=0
total=0
while count < 2:
    x = int(input("Enter Age"))
    total+=x
    count+=1
    
print(total/count)

Enter Age 20
Enter Age 21

20.5

In [33]:
count=0
total=0
while count < 10:
    x='hello kitty'
    count+=1

print(x)

hello kitty

In [49]:
score = 20
if score >= 90: 
     print ("A") 
elif score >= 80: 
     print ("B") 
elif score >= 70: 
     print ("C") 
elif score >= 60: 
     print ("D") 
else: 
    print ("F")

F

In [39]:
check = True
while check:
    name=input("Name")
    if "Betty" in name:
        check = False
    elif 'lida'in name:
        check = False

Name wanjiku
Name naomi
Name naomi lida

In [40]:
check = True
while check:
    name=input("Name")
    if "Betty" or "liz" in name:
        check = False

Name liz Betty

In [57]:
for x in range (0,105,5):
    print(x)

0
5
10
15
20
25
30
35
40
45
50
55
60
65
70
75
80
85
90
95
100

In [46]:
count = 0 
while count < 5: 
    print(count) 
    count += 1

0
1
2
3
4

In [60]:
score = 0
for score in range (5):
    score= int(input("Enter student score"))
    if score >= 90: 
         print ("A") 
    elif score >= 80: 
         print ("B") 
    elif score >= 70: 
         print ("C") 
    elif score >= 60: 
         print ("D") 
    else: 
        print ("F")

Enter student score 90

A

Enter student score 50

F

Enter student score 60

D

Enter student score 70

C

Enter student score 80

B

In [72]:
score = 0
sum = 0

for score in range (5):
    score= int(input("enter score"))
    if score >=90:
        print("A")
    elif score>=80:
        print("B")
    else:
        print("F")

    sum += score
print(sum, sum/5)

enter score 60

F

enter score 50

F

enter score 30

F

enter score 80

B

enter score 70

F
290 58.0

In [ ]:
'''
multiple line
comment
'''

In [74]:
def calculate_grade(score):
    if score >= 90:
        return "A"
    elif score >= 80:
        return "B"
    elif score >= 70:
        return "C"
    elif score >= 60:
        return "D"
    else:
        return "F"

def main():
    name = input("Enter student's name: ")
    age = int(input("Enter student's age: "))
    scores = [float(input(f"Enter score for subject {i+1}: ")) for i in range(3)]
    average_score = sum(scores) / len(scores)
    grade = calculate_grade(average_score)
    print(f"Student Name: {name}")
    print(f"Student Age: {age}")
    print(f"Average Score: {average_score}")
    print(f"Grade: {grade}")

if __name__ == "__main__":
    main()

Enter student's name:  Betty
Enter student's age:  15
Enter score for subject 1:  20
Enter score for subject 2:  40
Enter score for subject 3:  45

TypeError: 'int' object is not callable

In [ ]:
def calculate_grade(score):
    if score >= 90:
        return "A"
    elif score >= 80:
        return "B"
    elif score >= 70:
        return "C"
    elif score >= 60:
        return "D"
    else:
        return "F"

def main():
    name = input("Enter student's name: ")
    age = int(input("Enter student's age: "))
    scores = [float(input(f"Enter score for subject {i+1}: ")) for i in range(3)]
    average_score = sum(scores) / len(scores)
    grade = calculate_grade(average_score)
    print(f"Student Name: {name}")
    print(f"Student Age: {age}")
    print(f"Average Score: {average_score}")
    print(f"Grade: {grade}")

if __name__ == "__main__":
    main()

Enter student's name:  betty
Enter student's age:  15
Enter score for subject 1:  80

In [1]:
for x in range(0,11):#
    print(x)

0
1
2
3
4
5
6
7
8
9
10

In [ ]:
index = 0
while index < ('string'):
    print(string[index])
    index += 1
    input_string = input("Enter a string: ")

print(input_string)

In [4]:
def add_numbers(a, b):
    result = a + b
    return result
sum = add_numbers(5, 3)
print(sum)

8

PYTHON FUNCTIONS

In [6]:
def add_numbers(a, b):
    result = a + b
    return result
sum = add_numbers(5, 3)
print(sum)

8

In [7]:
def greet(name):
    return f"Hello, {name}!"

print(greet("Alice"))

Hello, Alice!

In [8]:
def multiply(a, b):
    """Returns the product of two numbers."""
    return a * b

print(multiply(4, 5))  
print(multiply.__doc__)

20
Returns the product of two numbers.

In [9]:
def my_function():
    local_variable = 10
    return local_variable

print(my_function())
# print(local_variable)  # This will raise an error because local_variable is not accessible here.

10

In [10]:
square = lambda x: x * x
print(square(5))

25

In [14]:
def calculate_area(length, width):#this is a user_defined function
    """Calculates the area of a rectangle.""" #This is a doc string
    area = length * width
    return area

def main(): #this is a built_in function
    length = float(input("Enter the length: "))
    width = float(input("Enter the width: "))
    area = calculate_area(length, width)#this is where we call the user_defined function
    print(f"The area of the rectangle is {area} square units.")

if __name__ == "__main__": #this is where we declare the docstring
    main() #this calls the main function

Enter the length:  40
Enter the width:  30

The area of the rectangle is 1200.0 square units.

In [18]:
def calculate_volume(length,width,height):
    """Calculate the volume of the cuboid"""
    volume= length*width*height
    return volume

def main():
    length= int(input("Enter the length"))
    height= int(input("Enter the height"))
    width= int(input("Enter the width"))
    volume= calculate_volume(length,width,height)
    print(f"The volume of the cuboid is {volume} cubic units")

if __name__ == "__main__":
    main()

Enter the length 30
Enter the height 40
Enter the width 35

The volume of the cuboid is 42000 cubic units

In [20]:
sum=0
for i in range(10):
    sum=sum+i
    print (sum)

0
1
3
6
10
15
21
28
36
45

In [22]:
for i in range(0,50,4):
    print (i)

0
4
8
12
16
20
24
28
32
36
40
44
48

In [27]:
x=4
y=9
print (x+y)

13

In [2]:
def calculate_sum(x,y):
    """calculate the sum of x and y"""
    sum= x + y
    return sum

def main():
    x=int(input("enter the value of x"))
    y=int(input("enter the value of y"))
    sum=calculate_sum(x,y)
    print(f"the sum of {x} and {y} is {sum}")

if __name__ == "__main__":
    main()

enter the value of x 89
enter the value of y 107

the sum of 89 and 107 is 196

In [4]:
def orange():
    print("hello")

orange()

hello

In [9]:
def greet (name):
    print("hello",name)
greet("john")

hello john

DATA STRUCTURES IN PYTHON

In [11]:
my_list = [1,2,3,4,5,6]
print (my_list[0])

1

In [26]:
grocery[2]="Kitungu"
grocery =["tomato","wiu","onion"]
ind=0
for item in grocery:
    if item=="onion":
        grocery[ind]="Kitungu"

    ind = ind +1
print(grocery)

['tomato', 'wiu', 'Kitungu']

In [30]:

ind =0
for item in grocery:
    #ind = ind + 1
    print(item)
    if item == "onion":
        item = "kitunguu"

print(grocery)

Kitungu
tomato
wiu
cabbage
['Kitungu', 'tomato', 'wiu', 'cabbage']

In [20]:
grocery.append("cabbage")
print(grocery)

['tomato', 'wiu', 'Kitungu', 'cabbage']

In [27]:
grocery.sort()
print(grocery)

['Kitungu', 'tomato', 'wiu']

In [28]:
print(grocery)

['Kitungu', 'tomato', 'wiu']

In [29]:
grocery.append("cabbage")
print (grocery)

['Kitungu', 'tomato', 'wiu', 'cabbage']

DATA STRUCTURES : DICTIONARIES

In [6]:
my_dictionary = {
"name": "person 1",
"age": 35,
"salary":400
}
print(my_dictionary)

{'name': 'person 1', 'age': 35, 'salary': 400}

In [7]:
my_dictionary = {
"name": ["person 1","person 2","person 3","person 4","person 5"],
"age": [35,12,34,56,78,90],
"salary": [400,500,700,600,300,75000],
}
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 12, 34, 56, 78, 90],
 'salary': [400, 500, 700, 600, 300, 75000]}

In [11]:
my_dictionary['location']=['Mombasa','Kisumu','Nakuru','Eldoret','Homabay']

In [12]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 12, 34, 56, 78, 90],
 'salary': [400, 500, 700, 600, 300, 75000],
 'location': ['Mombasa', 'Kisumu', 'Nakuru', 'Eldoret', 'Homabay']}

In [13]:
for key, value in my_dictionary.items():
    print(key,value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 12, 34, 56, 78, 90]
salary [400, 500, 700, 600, 300, 75000]
location ['Mombasa', 'Kisumu', 'Nakuru', 'Eldoret', 'Homabay']

In [3]:
import pandas as pd

In [5]:
my_dictionary

NameError: name 'my_dictionary' is not defined

In [13]:
my_dictionary = {
"name": ["person 1","person 2","person 3","person 4","person 5"," person 6"],
"age": [35,12,34,56,78,90],
"salary": [400,500,700,600,300,75000],
}
my_dictionary

{'name': ['person 1',
  'person 2',
  'person 3',
  'person 4',
  'person 5',
  ' person 6'],
 'age': [35, 12, 34, 56, 78, 90],
 'salary': [400, 500, 700, 600, 300, 75000]}

In [15]:
df= pd.DataFrame(my_dictionary)

In [17]:
df

        name  age  salary
0   person 1   35     400
1   person 2   12     500
2   person 3   34     700
3   person 4   56     600
4   person 5   78     300
5   person 6   90   75000

In [19]:
my_dictionary['location']=['Mombasa','Kisumu','Nakuru','Eldoret','Homabay','Kisii']

In [29]:
my_dictionary

{'name': ['person 1',
  'person 2',
  'person 3',
  'person 4',
  'person 5',
  ' person 6'],
 'age': [35, 12, 34, 56, 78, 90],
 'salary': [400, 500, 700, 600, 300, 75000],
 'location': ['Mombasa', 'Kisumu', 'Nakuru', 'Eldoret', 'Homabay', 'Kisii']}

In [25]:
df= pd.DataFrame(my_dictionary)

In [27]:
df

        name  age  salary location
0   person 1   35     400  Mombasa
1   person 2   12     500   Kisumu
2   person 3   34     700   Nakuru
3   person 4   56     600  Eldoret
4   person 5   78     300  Homabay
5   person 6   90   75000    Kisii

In [35]:
df["name"]

0     person 1
1     person 2
2     person 3
3     person 4
4     person 5
5     person 6
Name: name, dtype: object

In [37]:
df["location"]

0    Mombasa
1     Kisumu
2     Nakuru
3    Eldoret
4    Homabay
5      Kisii
Name: location, dtype: object

In [39]:
df[["name","age"]]

        name  age
0   person 1   35
1   person 2   12
2   person 3   34
3   person 4   56
4   person 5   78
5   person 6   90

In [47]:
df["age"]+1

0    36
1    13
2    35
3    57
4    79
5    91
Name: age, dtype: int64

In [51]:
df["age"]=df["age"]+1

In [53]:
df

        name  age  salary location
0   person 1   36     400  Mombasa
1   person 2   13     500   Kisumu
2   person 3   35     700   Nakuru
3   person 4   57     600  Eldoret
4   person 5   79     300  Homabay
5   person 6   91   75000    Kisii

In [61]:
df["age"],df["salary"]=df["age"]+1,df["salary"]+500

In [63]:
df

        name  age  salary location
0   person 1   37     900  Mombasa
1   person 2   14    1000   Kisumu
2   person 3   36    1200   Nakuru
3   person 4   58    1100  Eldoret
4   person 5   80     800  Homabay
5   person 6   92   75500    Kisii

DATA MANIPULATION

In [3]:
import pandas as pd

In [17]:
filepath=("DataFiles/data.xlsx")
df=pd.read_excel(filepath)

In [19]:
df

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [21]:
df.head()

      name  age   department  salary
0    Alice   30           HR   50000
1      Bob   24  Engineering   60000
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [23]:
df.tail()

      name  age   department  salary
6    Grace   31  Engineering   70000
7   Hannah   23        Sales   53000
8      Ian   34           HR   51000
9     Jack   28  Engineering   62000
10     Eve   29           HR   52000

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        11 non-null     object
 1   age         11 non-null     int64
 2   department  11 non-null     object
 3   salary      11 non-null     int64
dtypes: int64(2), object(2)
memory usage: 484.0+ bytes

In [27]:
df.shape

(11, 4)

In [29]:
df.values

array([['Alice', 30, 'HR', 50000],
       ['Bob', 24, 'Engineering', 60000],
       ['Charlie', 26, 'Sales', 55000],
       ['David', 35, 'Engineering', 80000],
       ['Eve', 29, 'HR', 52000],
       ['Frank', 27, 'Sales', 58000],
       ['Grace', 31, 'Engineering', 70000],
       ['Hannah', 23, 'Sales', 53000],
       ['Ian', 34, 'HR', 51000],
       ['Jack', 28, 'Engineering', 62000],
       ['Eve', 29, 'HR', 52000]], dtype=object)

In [31]:
df.columns

Index(['name', 'age', 'department', 'salary'], dtype='object')

In [33]:
df.describe()

             age        salary
count  11.000000     11.000000
mean   28.727273  58454.545455
std     3.744086   9299.071312
min    23.000000  50000.000000
25%    26.500000  52000.000000
50%    29.000000  55000.000000
75%    30.500000  61000.000000
max    35.000000  80000.000000

In [35]:
df.info

<bound method DataFrame.info of        name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000>

In [37]:
selected = df[['age','salary']]

In [39]:
selected

    age  salary
0    30   50000
1    24   60000
2    26   55000
3    35   80000
4    29   52000
5    27   58000
6    31   70000
7    23   53000
8    34   51000
9    28   62000
10   29   52000

In [41]:
df.iloc[3:9]  #this code is for selecting rows

     name  age   department  salary
3   David   35  Engineering   80000
4     Eve   29           HR   52000
5   Frank   27        Sales   58000
6   Grace   31  Engineering   70000
7  Hannah   23        Sales   53000
8     Ian   34           HR   51000

In [43]:
df.head()

      name  age   department  salary
0    Alice   30           HR   50000
1      Bob   24  Engineering   60000
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [45]:
df.sort_values(by="salary") #sorting data and in this case ascending comes by defalt

       name  age   department  salary
0     Alice   30           HR   50000
8       Ian   34           HR   51000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
7    Hannah   23        Sales   53000
2   Charlie   26        Sales   55000
5     Frank   27        Sales   58000
1       Bob   24  Engineering   60000
9      Jack   28  Engineering   62000
6     Grace   31  Engineering   70000
3     David   35  Engineering   80000

In [47]:
df.sort_values(by="salary",ascending=False) # so if you want to do descending you assign ascending to false

       name  age   department  salary
3     David   35  Engineering   80000
6     Grace   31  Engineering   70000
9      Jack   28  Engineering   62000
1       Bob   24  Engineering   60000
5     Frank   27        Sales   58000
2   Charlie   26        Sales   55000
7    Hannah   23        Sales   53000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
8       Ian   34           HR   51000
0     Alice   30           HR   50000

In [49]:
df.sort_values(by="age",ascending = False)

       name  age   department  salary
3     David   35  Engineering   80000
8       Ian   34           HR   51000
6     Grace   31  Engineering   70000
0     Alice   30           HR   50000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
9      Jack   28  Engineering   62000
5     Frank   27        Sales   58000
2   Charlie   26        Sales   55000
1       Bob   24  Engineering   60000
7    Hannah   23        Sales   53000

In [51]:
df[df["age"]<25] #it returns the condition that is true based on the arguement

     name  age   department  salary
1     Bob   24  Engineering   60000
7  Hannah   23        Sales   53000

In [53]:
df[df["salary"]<55000]

      name  age department  salary
0    Alice   30         HR   50000
4      Eve   29         HR   52000
7   Hannah   23      Sales   53000
8      Ian   34         HR   51000
10     Eve   29         HR   52000

In [55]:
df["location"]="Kisumu"

In [57]:
df

       name  age   department  salary location
0     Alice   30           HR   50000   Kisumu
1       Bob   24  Engineering   60000   Kisumu
2   Charlie   26        Sales   55000   Kisumu
3     David   35  Engineering   80000   Kisumu
4       Eve   29           HR   52000   Kisumu
5     Frank   27        Sales   58000   Kisumu
6     Grace   31  Engineering   70000   Kisumu
7    Hannah   23        Sales   53000   Kisumu
8       Ian   34           HR   51000   Kisumu
9      Jack   28  Engineering   62000   Kisumu
10      Eve   29           HR   52000   Kisumu

In [67]:
df.loc[7],"location"=='Nairobi'

(name           Hannah
 age                23
 department      Sales
 salary          53000
 location      Nairobi
 Name: 7, dtype: object,
 False)

In [69]:
df

       name  age   department  salary location
0     Alice   30           HR   50000   Kisumu
1       Bob   24  Engineering   60000   Kisumu
2   Charlie   26        Sales   55000   Kisumu
3     David   35  Engineering   80000   Kisumu
4       Eve   29           HR   52000   Kisumu
5     Frank   27        Sales   58000   Kisumu
6     Grace   31  Engineering   70000   Kisumu
7    Hannah   23        Sales   53000  Nairobi
8       Ian   34           HR   51000   Kisumu
9      Jack   28  Engineering   62000   Kisumu
10      Eve   29           HR   52000   Kisumu

In [75]:
df.drop(columns="location")

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [77]:
df["location"]="Kisumu"

In [79]:
df

       name  age   department  salary location
0     Alice   30           HR   50000   Kisumu
1       Bob   24  Engineering   60000   Kisumu
2   Charlie   26        Sales   55000   Kisumu
3     David   35  Engineering   80000   Kisumu
4       Eve   29           HR   52000   Kisumu
5     Frank   27        Sales   58000   Kisumu
6     Grace   31  Engineering   70000   Kisumu
7    Hannah   23        Sales   53000   Kisumu
8       Ian   34           HR   51000   Kisumu
9      Jack   28  Engineering   62000   Kisumu
10      Eve   29           HR   52000   Kisumu

In [87]:
df.loc[7],"location"=='Nairobi'

(name          Hannah
 age               23
 department     Sales
 salary         53000
 location      Kisumu
 Name: 7, dtype: object,
 False)

In [91]:
df.loc[df["name"]=="Hannah","location"]="Nairobi"

In [93]:
df

       name  age   department  salary location
0     Alice   30           HR   50000   Kisumu
1       Bob   24  Engineering   60000   Kisumu
2   Charlie   26        Sales   55000   Kisumu
3     David   35  Engineering   80000   Kisumu
4       Eve   29           HR   52000   Kisumu
5     Frank   27        Sales   58000   Kisumu
6     Grace   31  Engineering   70000   Kisumu
7    Hannah   23        Sales   53000  Nairobi
8       Ian   34           HR   51000   Kisumu
9      Jack   28  Engineering   62000   Kisumu
10      Eve   29           HR   52000   Kisumu

In [95]:
df.loc[5],"location"=='Marani'

(name           Frank
 age               27
 department     Sales
 salary         58000
 location      Kisumu
 Name: 5, dtype: object,
 False)

In [97]:
df.drop(columns="location",axis=1)

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [99]:
df

       name  age   department  salary location
0     Alice   30           HR   50000   Kisumu
1       Bob   24  Engineering   60000   Kisumu
2   Charlie   26        Sales   55000   Kisumu
3     David   35  Engineering   80000   Kisumu
4       Eve   29           HR   52000   Kisumu
5     Frank   27        Sales   58000   Kisumu
6     Grace   31  Engineering   70000   Kisumu
7    Hannah   23        Sales   53000  Nairobi
8       Ian   34           HR   51000   Kisumu
9      Jack   28  Engineering   62000   Kisumu
10      Eve   29           HR   52000   Kisumu

In [101]:
df=df.drop(columns="location",axis=1)

In [103]:
df

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [ ]:
GROUP BY AND AGRE

ASSIGNMENT

In [107]:
import pandas as pd

In [105]:
data = {
    'Student': ['Mercy', 'John', 'Betty', 'Cornelius', 'Judith'],
    'Math': [69, 90, 47, 92, 87],
    'Science': [78, 80, 92, 80, 68],
    'English': [82, 76, 58, 48, 70]
}

df = pd.DataFrame(data)

In [109]:
df

     Student  Math  Science  English
0      Mercy    69       78       82
1       John    90       80       76
2      Betty    47       92       58
3  Cornelius    92       80       48
4     Judith    87       68       70

In [111]:
df['Average'] = df[['Math', 'Science', 'English']].mean(axis=1)

In [113]:
df

     Student  Math  Science  English    Average
0      Mercy    69       78       82  76.333333
1       John    90       80       76  82.000000
2      Betty    47       92       58  65.666667
3  Cornelius    92       80       48  73.333333
4     Judith    87       68       70  75.000000

In [115]:
df.sort_values(by="Average",ascending=False)

     Student  Math  Science  English    Average
1       John    90       80       76  82.000000
0      Mercy    69       78       82  76.333333
4     Judith    87       68       70  75.000000
3  Cornelius    92       80       48  73.333333
2      Betty    47       92       58  65.666667

In [119]:
df.sort_values(by="Average")

     Student  Math  Science  English    Average
2      Betty    47       92       58  65.666667
3  Cornelius    92       80       48  73.333333
4     Judith    87       68       70  75.000000
0      Mercy    69       78       82  76.333333
1       John    90       80       76  82.000000

Create a list temperatures containing temperatures in Celsius. Convert these temperatures to
Fahrenheit using a list comprehension and store the result in a new list named
fahrenheit_temperatures.

In [133]:
temperatures = [0, 14, 24,34, 40, 44]

In [139]:
fahrenheit_temperatures = [(temp * 9/5) + 32 for temp in temperatures] 
#converting each temperature in the temperatures list to Fahrenheit.

In [141]:
print(fahrenheit_temperatures)

[32.0, 57.2, 75.2, 93.2, 104.0, 111.2]

DATA MANIPULATION ASSIGNMENT

In [143]:
import pandas as pd

In [151]:
filepath=("DataFile1/car_sales.csv")
df=pd.read_csv(filepath)

In [153]:
df

   Manufacturer      Model  Year  Sales  Revenue
0        Toyota    Corolla  2021   1500    50000
1        Toyota      Camry  2022   2000    70000
2         Honda      Civic  2022   1800    60000
3         Honda     Accord  2021   1700    65000
4          Ford    Mustang  2023   2200    80000
5          Ford     Fusion  2021   1600    55000
6     Chevrolet  Silverado  2022   1900    75000
7     Chevrolet     Malibu  2021   1400    50000
8        Nissan     Altima  2022   2100    70000
9        Nissan     Sentra  2023   2300    85000
10       Toyota      Prius  2021   1600    60000
11       Toyota       RAV4  2022   1900    65000
12        Honda       CR-V  2023   2200    75000
13        Honda      Pilot  2021   1500    55000
14         Ford   Explorer  2022   2000    70000
15         Ford     Escape  2023   2100    75000
16    Chevrolet    Equinox  2021   1700    60000
17    Chevrolet      Tahoe  2022   2200    80000
18       Nissan      Rogue  2023   2300    85000
19       Nissan     Murano  2021   1800    65000

In [157]:
df.tail()

   Manufacturer    Model  Year  Sales  Revenue
15         Ford   Escape  2023   2100    75000
16    Chevrolet  Equinox  2021   1700    60000
17    Chevrolet    Tahoe  2022   2200    80000
18       Nissan    Rogue  2023   2300    85000
19       Nissan   Murano  2021   1800    65000

In [165]:
import pandas as pd

In [192]:
data = {
    
    'students':['rose', 'ann','clere','jose'],
    'maths': [70,50,60,90],
    'science':[50,50,80,70],
    'english':[80,40,50,70]
}
df = pd.DataFrame(data)

In [194]:
df

  students  maths  science  english
0     rose     70       50       80
1      ann     50       50       40
2    clere     60       80       50
3     jose     90       70       70

In [209]:
df["Average"] = df[['maths', 'science', 'english']].mean(axis=1)

In [211]:
df

  students  maths  science  english    Average
0     rose     70       50       80  66.666667
1      ann     50       50       40  46.666667
2    clere     60       80       50  63.333333
3     jose     90       70       70  76.666667

In [213]:
df.sort_values(by="Average")

  students  maths  science  english    Average
1      ann     50       50       40  46.666667
2    clere     60       80       50  63.333333
0     rose     70       50       80  66.666667
3     jose     90       70       70  76.666667

In [115]:
df.sort_values(by="Average",ascending=False)

     Student  Math  Science  English    Average
1       John    90       80       76  82.000000
0      Mercy    69       78       82  76.333333
4     Judith    87       68       70  75.000000
3  Cornelius    92       80       48  73.333333
2      Betty    47       92       58  65.666667

In [52]:
temperatures =[0,15,20,25,30,35]

In [58]:
temperatures

[0, 15, 20, 25, 30, 35]

In [60]:
fahrenheit_temperatures = [(temp * 9/5) + 32 for temp in temperatures]

In [64]:
print(fahrenheit_temperatures)

[32.0, 59.0, 68.0, 77.0, 86.0, 95.0]

# GROUPING AND AGGREGATION

In [2]:
import pandas as pd

In [4]:
filepath=("DataFiles/data.xlsx")
df=pd.read_excel(filepath)

In [6]:
df

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [9]:
grouped= df.groupby("department")

In [11]:
grouped

In [13]:
df.groupby("department")['salary'].sum()

department
Engineering    272000
HR             205000
Sales          166000
Name: salary, dtype: int64

In [15]:
df.groupby("department")['salary'].mean()

department
Engineering    68000.000000
HR             51250.000000
Sales          55333.333333
Name: salary, dtype: float64

In [17]:
df.groupby("department").agg({'salary':['sum','mean','count','min','max','std','var','median',]})

             salary                                                 \
                sum          mean count    min    max          std
department
Engineering  272000  68000.000000     4  60000  80000  9092.121131
HR           205000  51250.000000     4  50000  52000   957.427108
Sales        166000  55333.333333     3  53000  58000  2516.611478


                      var   median
department
Engineering  8.266667e+07  66000.0
HR           9.166667e+05  51500.0
Sales        6.333333e+06  55000.0

In [21]:
df.groupby ("department").agg({'age':['sum','mean','count','min','max','std','var','median',]})

             age
             sum       mean count min max       std        var median
department
Engineering  118  29.500000     4  24  35  4.654747  21.666667   29.5
HR           122  30.500000     4  29  34  2.380476   5.666667   29.5
Sales         76  25.333333     3  23  27  2.081666   4.333333   26.0

# DATA CLEANING AND PREPARATION USING PYTHON
#1. Handling Data

## 22ND JULY 2024

In [1]:
import pandas as pd

In [36]:
filepath=("DataFile1/car_sales.csv")
df=pd.read_csv(filepath)

In [38]:
df

   Manufacturer      Model  Year   Sales  Revenue
0        Toyota    Corolla  2021  1500.0  50000.0
1        Toyota      Camry  2022  2000.0  70000.0
2         Honda      Civic  2022  1800.0  60000.0
3         Honda     Accord  2021  1700.0  65000.0
4          Ford    Mustang  2023  2200.0      NaN
5          Ford     Fusion  2021  1600.0  55000.0
6     Chevrolet  Silverado  2022  1900.0  75000.0
7           NaN     Malibu  2021  1400.0  50000.0
8        Nissan     Altima  2022  2100.0  70000.0
9        Nissan     Sentra  2023     NaN  85000.0
10       Toyota      Prius  2021  1600.0  60000.0
11       Toyota       RAV4  2022  1900.0  65000.0
12        Honda       CR-V  2023  2200.0  75000.0
13        Honda      Pilot  2021  1500.0  55000.0
14         Ford   Explorer  2022  2000.0  70000.0
15         Ford     Escape  2023  2100.0  75000.0
16    Chevrolet    Equinox  2021  1700.0  60000.0
17    Chevrolet      Tahoe  2022  2200.0  80000.0
18       Nissan      Rogue  2023  2300.0  85000.0
19       Nissan     Murano  2021  1800.0  65000.0
20         Ford     Escape  2023  2100.0  75000.0
21    Chevrolet    Equinox  2021  1700.0  60000.0
22    Chevrolet      Tahoe  2022  2200.0  80000.0
23       Nissan      Rogue  2023  2300.0  85000.0
24       Nissan     Murano  2021  1800.0  65000.0

In [40]:
df.isnull()

    Manufacturer  Model   Year  Sales  Revenue
0          False  False  False  False    False
1          False  False  False  False    False
2          False  False  False  False    False
3          False  False  False  False    False
4          False  False  False  False     True
5          False  False  False  False    False
6          False  False  False  False    False
7           True  False  False  False    False
8          False  False  False  False    False
9          False  False  False   True    False
10         False  False  False  False    False
11         False  False  False  False    False
12         False  False  False  False    False
13         False  False  False  False    False
14         False  False  False  False    False
15         False  False  False  False    False
16         False  False  False  False    False
17         False  False  False  False    False
18         False  False  False  False    False
19         False  False  False  False    False
20         False  False  False  False    False
21         False  False  False  False    False
22         False  False  False  False    False
23         False  False  False  False    False
24         False  False  False  False    False

In [42]:
df.notnull()

    Manufacturer  Model  Year  Sales  Revenue
0           True   True  True   True     True
1           True   True  True   True     True
2           True   True  True   True     True
3           True   True  True   True     True
4           True   True  True   True    False
5           True   True  True   True     True
6           True   True  True   True     True
7          False   True  True   True     True
8           True   True  True   True     True
9           True   True  True  False     True
10          True   True  True   True     True
11          True   True  True   True     True
12          True   True  True   True     True
13          True   True  True   True     True
14          True   True  True   True     True
15          True   True  True   True     True
16          True   True  True   True     True
17          True   True  True   True     True
18          True   True  True   True     True
19          True   True  True   True     True
20          True   True  True   True     True
21          True   True  True   True     True
22          True   True  True   True     True
23          True   True  True   True     True
24          True   True  True   True     True

In [44]:
df.isnull().sum() #this function displays the total number of missing values per columndf

Manufacturer    1
Model           0
Year            0
Sales           1
Revenue         1
dtype: int64

In [46]:
df[df.isnull().any(axis=1)] #displaying the exact rows that contain the missing values

  Manufacturer    Model  Year   Sales  Revenue
4         Ford  Mustang  2023  2200.0      NaN
7          NaN   Malibu  2021  1400.0  50000.0
9       Nissan   Sentra  2023     NaN  85000.0

In [48]:
df.fillna(value={"Manufacturer":"unknown"}, inplace=True) 
#the inplace function changes values directly into the original dataset

In [50]:
df[df.isnull().any(axis=1)]

  Manufacturer    Model  Year   Sales  Revenue
4         Ford  Mustang  2023  2200.0      NaN
9       Nissan   Sentra  2023     NaN  85000.0

In [56]:
average=df['Sales'].mean()
df.fillna(value={'Sales':average},inplace=True)

In [58]:
df.head(10)

  Manufacturer      Model  Year   Sales  Revenue
0       Toyota    Corolla  2021  1500.0  50000.0
1       Toyota      Camry  2022  2000.0  70000.0
2        Honda      Civic  2022  1800.0  60000.0
3        Honda     Accord  2021  1700.0  65000.0
4         Ford    Mustang  2023  2200.0      NaN
5         Ford     Fusion  2021  1600.0  55000.0
6    Chevrolet  Silverado  2022  1900.0  75000.0
7      unknown     Malibu  2021  1400.0  50000.0
8       Nissan     Altima  2022  2100.0  70000.0
9       Nissan     Sentra  2023  1900.0  85000.0

In [64]:
average=df['Revenue'].mean()     #we are replacing the missing value with the average of the revenue
df.fillna(value={'Revenue':average},inplace=True)

In [66]:
df.head(10)

  Manufacturer      Model  Year   Sales  Revenue
0       Toyota    Corolla  2021  1500.0  50000.0
1       Toyota      Camry  2022  2000.0  70000.0
2        Honda      Civic  2022  1800.0  60000.0
3        Honda     Accord  2021  1700.0  65000.0
4         Ford    Mustang  2023  2200.0      NaN
5         Ford     Fusion  2021  1600.0  55000.0
6    Chevrolet  Silverado  2022  1900.0  75000.0
7      unknown     Malibu  2021  1400.0  50000.0
8       Nissan     Altima  2022  2100.0  70000.0
9       Nissan     Sentra  2023  1900.0  85000.0

In [68]:
df.dropna(inplace=True)

In [70]:
df.head(10)

   Manufacturer      Model  Year   Sales  Revenue
0        Toyota    Corolla  2021  1500.0  50000.0
1        Toyota      Camry  2022  2000.0  70000.0
2         Honda      Civic  2022  1800.0  60000.0
3         Honda     Accord  2021  1700.0  65000.0
5          Ford     Fusion  2021  1600.0  55000.0
6     Chevrolet  Silverado  2022  1900.0  75000.0
7       unknown     Malibu  2021  1400.0  50000.0
8        Nissan     Altima  2022  2100.0  70000.0
9        Nissan     Sentra  2023  1900.0  85000.0
10       Toyota      Prius  2021  1600.0  60000.0

In [72]:
df[df.duplicated()] #returns the duplicates existing (penalty)

   Manufacturer    Model  Year   Sales  Revenue
20         Ford   Escape  2023  2100.0  75000.0
21    Chevrolet  Equinox  2021  1700.0  60000.0
22    Chevrolet    Tahoe  2022  2200.0  80000.0
23       Nissan    Rogue  2023  2300.0  85000.0
24       Nissan   Murano  2021  1800.0  65000.0

In [74]:
df.drop_duplicates(inplace=True) # Remove duplicate rows

In [76]:
df.tail()

   Manufacturer    Model  Year   Sales  Revenue
15         Ford   Escape  2023  2100.0  75000.0
16    Chevrolet  Equinox  2021  1700.0  60000.0
17    Chevrolet    Tahoe  2022  2200.0  80000.0
18       Nissan    Rogue  2023  2300.0  85000.0
19       Nissan   Murano  2021  1800.0  65000.0

In [82]:
df.duplicated().sum() # returns the number of duplicate rows remaining after droping

0

In [84]:
df.dtypes

Manufacturer     object
Model            object
Year              int64
Sales           float64
Revenue         float64
dtype: object

In [ ]:
# Example: Converting data types
df["age"] = df["age"].astype(float) # Convert 'age' column to float
#if you want to convert age from int to float.

In [88]:
new_df = pd.DataFrame({"name": ["Alice", "Bob", "Alice"], "age": [25, 30, 25]})

In [90]:
new_df

    name  age
0  Alice   25
1    Bob   30
2  Alice   25

In [94]:
new_df["age"] = new_df["age"].astype(float)

In [96]:
new_df

    name   age
0  Alice  25.0
1    Bob  30.0
2  Alice  25.0

In [98]:
df

   Manufacturer      Model  Year   Sales  Revenue
0        Toyota    Corolla  2021  1500.0  50000.0
1        Toyota      Camry  2022  2000.0  70000.0
2         Honda      Civic  2022  1800.0  60000.0
3         Honda     Accord  2021  1700.0  65000.0
5          Ford     Fusion  2021  1600.0  55000.0
6     Chevrolet  Silverado  2022  1900.0  75000.0
7       unknown     Malibu  2021  1400.0  50000.0
8        Nissan     Altima  2022  2100.0  70000.0
9        Nissan     Sentra  2023  1900.0  85000.0
10       Toyota      Prius  2021  1600.0  60000.0
11       Toyota       RAV4  2022  1900.0  65000.0
12        Honda       CR-V  2023  2200.0  75000.0
13        Honda      Pilot  2021  1500.0  55000.0
14         Ford   Explorer  2022  2000.0  70000.0
15         Ford     Escape  2023  2100.0  75000.0
16    Chevrolet    Equinox  2021  1700.0  60000.0
17    Chevrolet      Tahoe  2022  2200.0  80000.0
18       Nissan      Rogue  2023  2300.0  85000.0
19       Nissan     Murano  2021  1800.0  65000.0

In [100]:
df.head()

  Manufacturer    Model  Year   Sales  Revenue
0       Toyota  Corolla  2021  1500.0  50000.0
1       Toyota    Camry  2022  2000.0  70000.0
2        Honda    Civic  2022  1800.0  60000.0
3        Honda   Accord  2021  1700.0  65000.0
5         Ford   Fusion  2021  1600.0  55000.0

In [126]:
q1 = df["Sales"].quantile(0.25)
q3 = df["Sales"].quantile(0.75)
iqr= q3-q1
print(q1,q3,iqr)

1650.0 2050.0 400.0

In [128]:
lower_bond = q1 - 1.5 * iqr

In [130]:
lower_bond

1050.0

In [136]:
upper_bond= q3+1.5*iqr

In [138]:
upper_bond

2650.0

In [142]:
required = df[(df["Sales"]>= lower_bond)&(df["Sales"]<= upper_bond)]
print ("All Sales\n", df["Sales"].values)
print ("Sales after removing outliers\n", required["Sales"].values)

All Sales
 [1500. 2000. 1800. 1700. 1600. 1900. 1400. 2100. 1900. 1600. 1900. 2200.
 1500. 2000. 2100. 1700. 2200. 2300. 1800.]
Sales after removing outliers
 [1500. 2000. 1800. 1700. 1600. 1900. 1400. 2100. 1900. 1600. 1900. 2200.
 1500. 2000. 2100. 1700. 2200. 2300. 1800.]

In [144]:
df

   Manufacturer      Model  Year   Sales  Revenue
0        Toyota    Corolla  2021  1500.0  50000.0
1        Toyota      Camry  2022  2000.0  70000.0
2         Honda      Civic  2022  1800.0  60000.0
3         Honda     Accord  2021  1700.0  65000.0
5          Ford     Fusion  2021  1600.0  55000.0
6     Chevrolet  Silverado  2022  1900.0  75000.0
7       unknown     Malibu  2021  1400.0  50000.0
8        Nissan     Altima  2022  2100.0  70000.0
9        Nissan     Sentra  2023  1900.0  85000.0
10       Toyota      Prius  2021  1600.0  60000.0
11       Toyota       RAV4  2022  1900.0  65000.0
12        Honda       CR-V  2023  2200.0  75000.0
13        Honda      Pilot  2021  1500.0  55000.0
14         Ford   Explorer  2022  2000.0  70000.0
15         Ford     Escape  2023  2100.0  75000.0
16    Chevrolet    Equinox  2021  1700.0  60000.0
17    Chevrolet      Tahoe  2022  2200.0  80000.0
18       Nissan      Rogue  2023  2300.0  85000.0
19       Nissan     Murano  2021  1800.0  65000.0

In [148]:
df.to_csv('DataFile1/cleaned_Data.csv', index=False) #for exporting data to excel files